library(tidyverse)

s = "199、心阳暴脱:心阳暴脱冷汗厥冷唇青紫，气虚为始舌淡紫
200、心脉痹阻:心脉痹阻憋闷痛，痛引肩背内臂时作止，心脉痹阻寒痰瘀气滞
201、瘀阻脑络:心悸怔忡失眠忘，头痛头晕瘀血证
202、心血虚证: 心悸怔忡失眠梦，健忘头晕面黄白
203、心阴虚证:心悸怔忡失眠梦，心烦心热阴虚证
204、心气虚证: 心悸怔忡汗胸闷，气短神疲气虚证
205、心阳虚证:心悸怔忡汗胸闷，畏寒面白阳虚证
206、心阳暴脱:心悸怔忡汗胸痛，肢厥面苍呼吸微，神昏淡紫脉欲绝
207、心火亢盛:心烦失眠面赤渴,口舌生疮吐衄血，狂躁谵语实热证
208、小肠实热:心烦失眠面赤渴，口舌生疮痛尿血，小便赤涩实热证
209、痰蒙心神:神昏痴呆癫痫症，表情淡漠喃喃语，昏仆吐涎面晦滞，喉中痰鸣苔白腻
210、痰火扰神:神昏谵语狂躁证，打人妄动笑无常，气粗面赤失眠烦，喉中痰鸣苔黄腻
211、肺气虚证:喘咳无力痰清晰，自汗恶风易感冒
212、肺阴虚证:干咳带血少而黏，口燥声嘶阴虚证
213、风热犯肺:咳嗽痰黄流浊涕，咽痛痰稠表热证
214、燥邪犯肺:干咳痰黏不易咯，胸痛带血燥淫证 【无五心烦热】
215、风寒束肺:痰稀色白表寒证，头痛无汗脉浮紧
216、寒痰阻肺:痰多色白咳喘鸣，胸闷肢冷脉濡滑
217、肺热炽盛:咳嗽鼻煽胸闷痛，面赤灼热咽肿痛，口渴苔黄脉有力
218、痰热壅肺:咳嗽鼻煽胸闷痛，痰鸣痰黄脓血痰，烦躁口渴脉滑数
219、大肠湿热:肛门灼热腹痛泻， 里急后重下痢血，渴不多饮尿短赤【表证湿】
220、肠燥津亏:便干羊粪腹胀痛，包块口臭面头晕，苔红少津脉细数
221、脾气虚证:少胀便泌瘦肿胖， 食后加重面黄白
222、脾阳虚证:少胀便溏寒少肿，带清稀多舌淡胖
223、脾虚气陷:腹胀重坠食后甚，便频久泻内脏垂,小便米泔头目眩
224、脾不统血:出血经多气虚证【无小便浑】
225、寒湿困脾:脘腹痞闷阴黄证，纳呆便溏头身，肢体浮肿尿短少，白带清稀量又多
226、湿热蕴牌:脘腹腹闷阳黄证，纳呆便溏头身重，渴不多饮甜苦黏，身热不扬肤瘙痒
227、胃气虚证:脘闷隐隐按觉舒，恶逆嗳气气虚证
228、胃阳虚证:脘冷缩绵喜温按，食后缓解夜痛盛，泛吐清酸虚寒证
229、胃阴虚证:脘灼隐隐呕呃逆，嘈杂脘痞饥不食，口燥咽干阴虚证【无五心烦热，大便稀溏，小便短少】
230、胃火炽盛:脘灼拒按消谷饥，渴喜冷饮牙烂肿，便秘尿黄实热证
231、寒滞胃脘:脘冷痛急得温减，恶呕吐减泛清水，口淡不渴吐清水
232、食滞胃脘:脘胀拒按嗳腐酸，吐减腹胀泻臭秽
233、肝血虚证:眩晕耳鸣视力糊，肢麻拘急爪不荣，手颤肌瞤面无华,经闭量少色又淡
234、肝阴虚证:头晕耳鸣视目涩，面部烘热胁隐痛，手蠕心烦阴虚证
235、肝郁气滞:胀闷窜痛善太息，抑郁易怒梅核气，瘿瘤乳癖与积块，乳胀痛经经不调
236、肝火炽盛:头目胀，头晕耳鸣面目赤，失眠多梦易急躁，口苦口干胁灼痛，吐衄便秘黄弦数
237、肝阳上亢:头目胀，头晕耳鸣面目赤，失眠多梦易急躁，头重脚轻肝肾阴
238、肝阳化风:眩晕欲仆头摇痛，舌强言謇手足麻，项强肢颤步履飘，猝倒口歪喉中痰
           热极生风:高热神昏燥如狂，抽搐强直角弓张，牙关紧闭动风状，两目上视舌红绛
           阴虚动风:手足蠕动目干涩，眩晕耳鸣阴虚状
           血虚动风:手足颤动头眼花，肢麻拘急爪不荣，手颤肌瞤面无华
239、肝胆湿热:胁灼痞块阴湿疹，带黄阳黄寒热往，厌食腹胀泛恶吐
240、寒滞肝脉:巅顶冷痛吐清涎，腹冷囊缩实寒证
241、胆郁痰扰:眩晕耳鸣胆怯惊，烦躁胁闷失眠梦,口苦恶呕痰热证
242、肾精不足:腰酸健忘神呆钝，发育迟缓生殖退，精少不育不孕闭
243、肾阴虚证:腰酸健忘失眠梦，经闭经少或崩漏，遗精早泄阳强举，眩晕耳鸣阴虚证
244、肾阳虚证:腰酸肢冷下肢甚，头晕五更面黑白，性淡清精阳痿泄，不孕尿频白带多，下陷浮肿阳虚脉
245、肾气不固:腰酸神疲耳鸣聋，遗尿尿频沥不尽，滑精早泄白带多，胎动易 滑气虚证
246、肾虚水泛:腰酸浮肿下肢甚，腹胀心悸短鸣喘
247、肾不纳气:呼多吸少动尤甚，肾虚气虚阴虚证
248、膀胱湿热:尿频尿急尿灼痛，便黄带血有砂石，腹胀腰痛湿热证
249、心肾不交:心烦失眠惊梦多，头晕耳鸣与健忘，腰酸遗精阳痿泻，五心烦热阴虚证
250、心肾阳虚;肢冷浮肿心怔忡,腰酸萎靡虚寒证
251、心肺气虚:胸闷心悸咳气喘，痰稀自汗气虚证
252、心脾两虚:心悸怔忡失眠梦，食欲不振腹便溏，出血经少气血虚
253、心肝血虚:心悸怔忡失眠梦，目涩视糊爪不荣，肢麻震颤面无华，经少色淡甚闭经
254、肺脾气虚:腹胀便溏气短喘，久咳不止咳痰稀，面浮肢肿气虚证
255、肺肾气虚:呼多吸少喘无力，耳鸣腰酸气虚证
256、肺肾阴虚:干咳少痰中带血，腰酸遗精经不调，口燥声嘶阴虚证
257、肝肾阴虚:目干失眠胁隐痛，腰酸耳鸣眩晕忘，遗精经少虚热证
258、肝火犯肺:头晕头胀胁灼痛，咳嗽痰黄甚咳血，急躁烦苦面目赤【无喉肿痛，咯脓血腥臭痰】
259、肝郁脾虚:太息急躁胁窜痛，泻后痛减溏不爽，肠鸣矢气溏不调
260、肝胃不和:太息急躁胁窜痛，嗳气呃逆脘痞满，吞酸嘈杂食纳呆
261、脾肾阳虚:腰酸肢冷久泄痢，完谷不化五更泻，面浮肢肿虚寒证"


s_list = s %>%
  str_replace_all(":", "：") %>%
  str_replace_all(" ", "") %>%
  str_replace_all(",", "，") %>%
  str_split("\n") %>%
  unlist()
s_list

num = 1
doc = officer::read_docx()

for (line in seq_along(s_list)) {
  s_line = s_list[line]
  if (str_detect(s_line, "^\\d")) {
    text = str_split(s_line, '、')[[1]][2]
    s_line = str_glue("{num}、{text}")
    num = num + 1
  }
  doc = officer::body_add(doc, s_line)
}

print(doc, "/Users/cuinuan/Desktop/s.docx")
